---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.Dispose
source: html/c51e7884-7a81-c160-4008-1b3bf6ba8bac.htm
---
# Autodesk.Revit.DB.ExportLayerTable.Dispose Method

Releases all resources used by the ExportLayerTable

## Syntax (C#)
```csharp
public void Dispose()
```